<?php

namespace Database\Seeders;


use App\Models\Products\Product;
use App\Models\Store\ProductInputHeader;
use App\PaymentType;
use Illuminate\Database\Seeder;

class Bill1525 extends Seeder
{
    public string $qerbah = 'قربة';
    public string $backet = 'باكت';
    public string $vialah = 'فيالة';
    public string $ambola = 'امبولة';
    /**
     * Seed the application's database.
     */
    public function createBill(int $bill_number, array $data): void
    {
        $header = ProductInputHeader::factory()->create([
            'bill_number' => $bill_number
        ]);
        foreach ($data as $page) {
            foreach ($page as $item) {

                $product = Product::factory()->create([
                    'name_ar' => $item['n'],
                    'sell_price' => $item['u_cost'] + ($item['u_cost'] * 0.3),
                ]);
                $header->items()->create([
                    'product_id' => $product->id,
                    'quantity' => $item['qt'],
                    'unit_cost_price' => $item['u_cost'],
                    'total_cost_price' => $item['u_cost'] * $item['qt'],
                    'expire_date' => trim($item['ex'] ?? ' '),
                    'payment_type' => PaymentType::cash,

                ]);
            }
        }

    }
    public function run(): void
    {
        $bill1525 = [
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 580, 'n' => 'قساطر سلكون مقاس 16'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 580, 'n' => 'قساطر سلكون مقاس 14'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 580, 'n' => 'قساطر سلكون مقاس 12'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 750, 'n' => 'قساطر سلكون ابو 10'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 750, 'n' => 'قساطر سلكون مقاس 6'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 750, 'n' => 'قساطر سلكون مقاس 8'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 110, 'n' => 'قرب بول'],
            ['ty' => 'باکت', 'qt' => 5, 'u_cost' => 1100, 'n' => 'شاش معقم 10*10 عبوة 50'],
            ['ty' => 'باکت', 'qt' => 3, 'u_cost' => 6500, 'n' => 'جلفز معقم ماليزي 7.5'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 170, 'n' => 'رایز تیوب مقاس 16'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 170, 'n' => 'رايز تيوب مقاس 14'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 170, 'n' => 'رایز تیوب مقاس 12'],
            ['ty' => 'حبة', 'qt' => 3, 'u_cost' => 6200, 'n' => 'سنتر لاين مقاس 7'],
            ['ty' => 'حبة', 'qt' => 1, 'u_cost' => 7500, 'n' => 'سنتر لاين مقاس 3'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 200, 'n' => 'قطن ابو 50 جرام'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 170, 'n' => 'رايز تيوب مقاس 8'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 170, 'n' => 'فيدنق تيوب 10'],
        ];
        $bill1526 = [
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 300, 'n' => 'قطن ابو 100 جرام'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 1200, 'n' => 'قطن 500 جرام'],
            ['ty' => 'حبة', 'qt' => 2, 'u_cost' => 2400, 'n' => 'قطن ابو 1000 جرام'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 680, 'n' => 'قطن ابو 250'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 250, 'n' => 'كمام اكسجين اسمول'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 250, 'n' => 'كمام اكسجين مديم'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 250, 'n' => 'كمام اكسجين كبار'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 350, 'n' => 'كمام نيو بليزر اسمول'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 350, 'n' => 'كمام نيو بليزر لارج'],
            ['ty' => 'حبة', 'qt' => 75, 'u_cost' => 120, 'n' => 'اندر باد صيني عبوة 25'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 3000, 'n' => 'سركت تخدير اطفال'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 1400, 'n' => 'سركت تخدير كبار'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 3000, 'n' => 'شرکت تخدير ابو فلترين'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 400, 'n' => 'مكرو دروب ابو 150'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 380, 'n' => 'موصلات تقطير'],
            ['ty' => 'حبة', 'qt' => 10, 'u_cost' => 200, 'n' => 'موصلات قرب دم'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 60, 'n' => 'سكشن تيوب مقاس 10'],
        ];
        $bill1528 = [
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 1700, 'n' => 'سيرنج 5 مل'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 2700, 'n' => 'سيرنج 20 مل'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 1700, 'n' => 'سيرنج 3 مل'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 2700, 'n' => 'سيرنج ابو 10'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 3800, 'n' => 'سيرنج ابو 50 تغذية'],
            ['ty' => 'پاکت', 'qt' => 1, 'u_cost' => 3800, 'n' => 'سيرنج ابو 50 مل'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 1200, 'n' => 'خيوط سلك اسباني كتنج مقاس 2.0'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 12500, 'n' => 'كاثيولا 26'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 11800, 'n' => 'كاثيولا مقاس 24 قصير'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 380, 'n' => 'ثري وي'],
            ['ty' => 'باکت', 'qt' => 8, 'u_cost' => 1500, 'n' => 'جلفز لاتكس ماليزي مع البودر اسمول'],
            ['ty' => 'شدة', 'qt' => 2, 'u_cost' => 1500, 'n' => 'الكترود ECG'],
            ['ty' => 'شدة', 'qt' => 1, 'u_cost' => 2700, 'n' => 'الكترود ECG'],
            ['ty' => 'حبة', 'qt' => 80, 'u_cost' => 90, 'n' => 'کاندم بول L'],
            ['ty' => 'حبة', 'qt' => 60, 'u_cost' => 60, 'n' => 'الصق عجل مقاس 2.51'],
            ['ty' => 'حبة', 'qt' => 60, 'u_cost' => 120, 'n' => 'الصق عجل مقاس 2.53'],

        ];
        $bill1529 = [
            ['ty' => 'باکت', 'qt' => 2, 'u_cost' => 900, 'n' => 'لصق عمليات 1010 عبوة 25'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 2200, 'n' => 'لصق عمليات 1510 عبوة 50'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 4800, 'n' => 'الصق عمليات 3010 عبوة 50'],
            ['ty' => 'باکت', 'qt' => 5, 'u_cost' => 1200, 'n' => 'جلفز فينال ابيض مقاس مديم M'],
            ['ty' => 'باکت', 'qt' => 5, 'u_cost' => 300, 'n' => 'فاین مبلل'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 500, 'n' => 'فاين مبلل كبير'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 400, 'n' => 'فاین مبلل وسط'],
            ['ty' => 'حبة', 'qt' => 12, 'u_cost' => 110, 'n' => 'رباط ضاغط مقاس 310'],
            ['ty' => 'حبة', 'qt' => 12, 'u_cost' => 150, 'n' => 'رباط ضاغط مقاس 15'],
            ['ty' => 'حبة', 'qt' => 12, 'u_cost' => 80, 'n' => 'رباط ضاغط مقاس 7.5'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 300, 'n' => 'كمام ربل'],
            ['ty' => 'حبة', 'qt' => 6, 'u_cost' => 350, 'n' => 'اندر تركل تيوب مع الكف 2.5'],
            ['ty' => 'حبة', 'qt' => 3, 'u_cost' => 350, 'n' => 'اندر تركل تيوب مع الكف 3.5'],
            ['ty' => 'حبة', 'qt' => 3, 'u_cost' => 350, 'n' => 'اندر تركل تيوب مع الكف 4'],
            ['ty' => 'حبة', 'qt' => 3, 'u_cost' => 350, 'n' => 'اندر تركل تيوب مع الكف 6'],
            ['ty' => 'حبة', 'qt' => 6, 'u_cost' => 350, 'n' => 'اندر تركل تيوب مع الكف 7'],
            ['ty' => 'حبة', 'qt' => 7, 'u_cost' => 65, 'n' => 'فيدنق تيوب 6'],
            ['ty' => 'حبة', 'qt' => 3, 'u_cost' => 65, 'n' => 'فيدنق تيوب 6'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 60, 'n' => 'سكشن تيوب مقاس 6'],
            ['ty' => 'باکت', 'qt' => 1, 'u_cost' => 3000, 'n' => 'سيرنج أبو 1 انسولين'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 150, 'n' => 'نازل اكسجين لارج'],
            ['ty' => 'حبة', 'qt' => 20, 'u_cost' => 50, 'n' => 'علب براز معقم'],
            ['ty' => 'حبة', 'qt' => 5, 'u_cost' => 180, 'n' => 'ثري وي'],
        ];
        $bill55037 = [
            ['ty' => 'باكت', 'qt' => 1, 'u_cost' => 14500, 'n' => 'بوليميكورت ٥ ملح مل محلول ناتكو'],
            ['ty' => 'امبولة', 'qt' => 30, 'u_cost' => 200, 'n' => 'بوتاسيوم امبول ابو فارع الغيالة'],
            ['ty' => 'فيالة', 'qt' => 6, 'u_cost' => 980, 'n' => 'صوديوم بيكربونات فيال ٥٠مل ابو فارع'],
            ['ty' => 'باكت', 'qt' => 2, 'u_cost' => 6200, 'n' => 'سومازينا امبول ۱۰۰۰ ملح الشرق . امبولات'],
            ['ty' => 'باكت', 'qt' => 3, 'u_cost' => 2200, 'n' => 'جلكونات كالسيوم ١٠ مل امبول رویال فارما'],
            ['ty' => 'باكت', 'qt' => 1, 'u_cost' => 3200, 'n' => 'اسیست امبول المفضل'],
        ];
        $this->createBill(1525, [$bill1525]);
        $this->createBill(1526, [$bill1526]);
        $this->createBill(1528, [$bill1528]);
        $this->createBill(1529, [$bill1529]);
        $this->createBill(55037, [$bill55037]);


    }
}
