<?php

namespace Database\Seeders;

use App\Models\Products\Product;
use App\Models\Sales\SaleHeader;
use App\Models\Store\ProductInput;
use App\Models\Store\ProductInputHeader;
use App\Models\User;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\PaymentType;
use Illuminate\Database\Seeder;

class ProductInputSeeder extends Seeder
{

    function run() : void {
        $headers = require 'database/seeders/data/product_input_headers.php';
        ProductInputHeader::factory()->createMany($headers);
        
        $inputs = require 'database/seeders/data/product_inputs.php';
        ProductInput::factory()->createMany($inputs);
    }


    public function createProductInput(array $data): void
    {

        $header = ProductInputHeader::factory()->create([
            'bill_number' => $data['bill_number']
        ]);
        foreach ($data['data'] as $item) {

            $header->items()->create([
                'product_id' => $item['product_id'],
                'quantity' => $item['qt'],
                'unit_cost_price' => $item['u_cost'],
                'total_cost_price' => $item['u_cost'] * $item['qt'],
                'expire_date' => trim($item['ex'] ?? ' '),
                'payment_type' => PaymentType::cash,
//                'bill_number'=>$item['bill_number']

            ]);
        }
    }
    public function v1(): void
    {
        $data = [
            [
                'bill_number' => 670382,
                'data' =>
                [
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1100,  'qt' => 4, 'n' => 'اوجمين شراب ۲۲۸ ملجم الدوانية الحديثة', 'product_id' => 67],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 730,  'qt' => 5, 'n' => 'موكسالين ٢٥٠ ملجم شراب الدوائية الحديثة', 'product_id' => 68],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 975,  'qt' => 4, 'n' => 'او جمين ١٥٦ ملجم شراب الدوائية الحديثة', 'product_id' => 69],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1400,  'qt' => 4, 'n' => 'اوجمين ۳۱۲ ملجم شراب الدوائية الحديثة', 'product_id' => 70],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1500,  'qt' => 4, 'n' => 'اوجمين ٤٥٧ ملجم شراب الدوائية الحديثة', 'product_id' => 71],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 495,  'qt' => 4, 'n' => 'قومين ٧٥ اقراص الدوائية الحديثة', 'product_id' => 72],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 3850,  'qt' => 3, 'n' => 'كبير ميبو مرهم ٣٠ جرام جلفار', 'product_id' => 73],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 700,  'qt' => 5, 'n' => 'جوافا شراب ۱۲۰ مل الرشيد سعال', 'product_id' => 74],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1845,  'qt' => 7, 'n' => 'نيتروماك ريتارد ٢.٥ ملجم ٦٠ك الفتح', 'product_id' => 75],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 550,  'qt' => 5, 'n' => 'فاركونسيل ١٢٥ ملجم شراب ٨٠ مل فاركو موكسالين', 'product_id' => 76],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 640,  'qt' => 5, 'n' => 'فاركونسيل ٢٥٠ منجم شراب ٨٠ مل قار کو موكسالين', 'product_id' => 77],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 650,  'qt' => 3, 'n' => 'فيتامين سي ۱۰۰۰ مل ظروف فاركو فوار سي', 'product_id' => 78],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 520,  'qt' => 5, 'n' => 'يوريكول فرار ١٢ كيس فاركو', 'product_id' => 79],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1590,  'qt' => 3, 'n' => 'اسبرين مغلف ٧٥ ملجم اقراص المحضار اخوان', 'product_id' => 80],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1500,  'qt' => 3, 'n' => 'سيبرولون ٢٥ ملح أقراص الكتون أمير الدين', 'product_id' => 81],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 750,  'qt' => 5, 'n' => 'كلين انما حقن شرجية كبار العزاني', 'product_id' => 82],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 970,  'qt' => 5, 'n' => 'بندول شراب للرضع بنكة الفراولة المنصوب', 'product_id' => 83],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1750,  'qt' => 5, 'n' => 'بندول شراب أزرق للأطفال اليكسير ١٠٠ مل المنصوب', 'product_id' => 84],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2100,  'qt' => 2, 'n' => 'سولبادين فوار المنصوب', 'product_id' => 85],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1150,  'qt' => 3, 'n' => 'بندول اكستر - المنصوب وكالة', 'product_id' => 86],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2850,  'qt' => 2, 'n' => 'نورمادبين 5 ملجم اقراص بلقيس', 'product_id' => 87],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 3490,  'qt' => 1, 'n' => 'نورمادبين ١٠ ملم اقراص بلقيس', 'product_id' => 88],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1.815,  'qt' => 3, 'n' => 'اتروليب ١٠ ملجم اقراص ٣٠ ٤ سيبلا', 'product_id' => 89],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2.725,  'qt' => 3, 'n' => 'اتروليب ۲۰ ملجم اقراص ٣٠ سيبلا', 'product_id' => 90],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1.55,  'qt' => 3, 'n' => 'اتروليب ٤٠ ملجم اقراص ۱۰ ق سيبلا', 'product_id' => 91],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1645,  'qt' => 3, 'n' => 'ديتور ١٠ ملجم اقراص سيبلا', 'product_id' => 92],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1895,  'qt' => 3, 'n' => 'ديتور ۲۰ ملجم اقراص سيبلا', 'product_id' => 93],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1245,  'qt' => 5, 'n' => 'بانتوسيك ٤٠ ملجم اقراص سيبلا', 'product_id' => 94],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 3475,  'qt' => 3, 'n' => 'دوفلاك شراب الراقة بدون مرتجع', 'product_id' => 95],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 5460,  'qt' => 1, 'n' => 'نيادي بنك ريتارد ۲۰ ملجم ۱۰۰ الغزالي', 'product_id' => 96],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 470,  'qt' => 5, 'n' => 'ايبوفلام شراب ۱۰۰ مل كبير شفاكو', 'product_id' => 97],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 600,  'qt' => 5, 'n' => 'اسبيكوت ٧٥ ملجم اقراص شفاكو أسبرين مختلف', 'product_id' => 98],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2250,  'qt' => 6, 'n' => 'كلوفال ٧٥ ملح اقراص ۲۸ قرص شفاكو بلافيكس كلوبي', 'product_id' => 99],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1540,  'qt' => 5, 'n' => 'اكسوبان ٤٠ ملجم كبسول ٣٠ ك بانتوبرازول شفاكو', 'product_id' => 100],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 600,  'qt' => 10, 'n' => 'فولتين دي تي شفاكو ايمفيناك', 'product_id' => 101],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 260,  'qt' => 7, 'n' => 'امول اقراص صغير شفاكر', 'product_id' => 102],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 320,  'qt' => 7, 'n' => 'امول اكسترا شريطين اقراص شفاكو', 'product_id' => 103],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 500,  'qt' => 3, 'n' => 'ميوفيت سي أكياس ۱۰۰۰ ملجم شفاكو فيتامين سي', 'product_id' => 104],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1400,  'qt' => 2, 'n' => 'او ميتوب ۲۰ ملجم اقراص شفاكو', 'product_id' => 105],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 600,  'qt' => 4, 'n' => 'فيتامين سي صافي فوار القادري فيت سي', 'product_id' => 106],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 640,  'qt' => 4, 'n' => 'كالسيوم فيتامين سي فوار القادري كالسيفيت', 'product_id' => 107],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1200,  'qt' => 3, 'n' => 'سولباقيز فوار رويال سولبادين', 'product_id' => 108],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 480,  'qt' => 3, 'n' => 'کولداکت شراب بیوفارم فلوكيت فلودرين', 'product_id' => 109],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 510,  'qt' => 3, 'n' => 'كولداكت كبسول بيوفارما فلوتاب', 'product_id' => 110],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 940,  'qt' => 4, 'n' => 'امفيناك دي تي ٥٠ ملجم ك النهدي ديكلوفين', 'product_id' => 111],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 280,  'qt' => 10, 'n' => 'زبین شراب رنتل الجبر فارما', 'product_id' => 112],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 190,  'qt' => 10, 'n' => 'زبين ۲۰۰ ملجم زنتل / اقراص الجبر فارما', 'product_id' => 113],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 400,  'qt' => 10, 'n' => 'ماء سيد شراب الوراقي ماء غريب', 'product_id' => 114],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 980,  'qt' => 5, 'n' => 'ابیدون ١٢٥ ملجم شراب أمون القاهرة', 'product_id' => 115],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 430,  'qt' => 10, 'n' => 'بيروفين قطر سباء فارما', 'product_id' => 116],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 510,  'qt' => 5, 'n' => 'هستات شراب ١٠٠ مل سباء فارما', 'product_id' => 117],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 479,  'qt' => 5, 'n' => 'موتلين ٦٠ ملجم شراب سباء فارما', 'product_id' => 118],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 395,  'qt' => 10, 'n' => 'هكساديل مضمضه ١٠٠ مل سباء فارما', 'product_id' => 119],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 4150,  'qt' => 1, 'n' => 'فالسيترى ٢٦/٢٤ ملجم ٣٠ قرص ساكو بلاص سفرماد', 'product_id' => 120],

                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 270,  'qt' =>  5, 'n' => 'هستات اقرص ۲۰ ق سباء فارما', 'product_id' => 122],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 450,  'qt' =>  5, 'n' => 'موتلين ٣٠ مل قطر سباء فارما', 'product_id' => 123],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 210,  'qt' =>  5, 'n' => 'يوتابين قيال ١.٢ فيال لاااااااب بعوم', 'product_id' => 124],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2890,  'qt' =>  2, 'n' => 'جارديان ۱۰ ملج القرص ايمبافت ابن القادري', 'product_id' => 125],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2645,  'qt' =>  2, 'n' => 'جارديان ٢٥ ملجم اقرص ايمپافنت ابن القادري -', 'product_id' => 126],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2080,  'qt' =>  2, 'n' => 'ايمبا ١٠ ملجم اقراص العالميه ايمباقنت', 'product_id' => 127],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 3100,  'qt' =>  2, 'n' => 'ايمبا ٢٥ ملجم اقراص العالميه ايمبافنت', 'product_id' => 128],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 550,  'qt' =>  10, 'n' => 'أمبروفين فراولة ۱۰۰مل اليمنية المصرية 7', 'product_id' => 129],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2800,  'qt' =>  2, 'n' => 'لينوبريل ١٠ ملجم اقراص الدولية الاردنية', 'product_id' => 130],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1900,  'qt' =>  2, 'n' => 'لينوبريل 5ملجم اقراص الدولية الأردنية', 'product_id' => 131],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 280,  'qt' =>  10, 'n' => 'اسبين 100 ملجم اقراص سيبلا', 'product_id' => 132],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1709,  'qt' =>  2, 'n' => 'لوماك ۲۰ منجم كبسول أشرطة سيبلا', 'product_id' => 133],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 220,  'qt' =>  3, 'n' => 'ميبو مرهم صغير أبو زيد', 'product_id' => 134],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 870,  'qt' =>  3, 'n' => 'فاديرين 81 ملجم اقراص هيلثي فارما جوسبرين -', 'product_id' => 135],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2480,  'qt' =>  3, 'n' => 'ابيكسان هيل 5 ملجم اقراص ابيكسا هيلان', 'product_id' => 136],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 435,  'qt' =>  5, 'n' => 'سكو فاست اقراص العابد امفيناك بدون مرتجع', 'product_id' => 137],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 520,  'qt' =>  5, 'n' => 'بوفين شراب ۱۰۰مل الخياط امبروفين شراب', 'product_id' => 138],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 6700,  'qt' =>  3, 'n' => 'بلافيكس ٧٥ ملجم اقراص الصباري ', 'product_id' => 139],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 5200,  'qt' => 30, 'n' => 'سباء فارما', 'product_id' => 121],


                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 560,  'qt' => 5, 'n' => 'موكسالين ١٢٥ ملجم شراب الدوائية الحديثة', 'product_id' => 140],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 600,  'qt' => 5, 'n' => 'توسكان شراب الجبل', 'product_id' => 141],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 940,  'qt' => 4, 'n' => 'بيستول ۲٫٥ ملغ اقراص الجبل', 'product_id' => 142],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1150,  'qt' => 4, 'n' => 'بیستول ٥ ملغ اقراص عادي الجبل', 'product_id' => 143],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 4000,  'qt' => 2, 'n' => 'سوفيكان ٢٠ ملغ اقراص الجبل', 'product_id' => 144],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2795,  'qt' => 2, 'n' => 'سوفيكان ١٠ ملح أقراص الجبل الحكمه', 'product_id' => 145],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 425,  'qt' => 5, 'n' => 'موتيل ١٠٠مل موتلين شراب العالمية', 'product_id' => 146],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 1300,  'qt' => 4, 'n' => 'نيولاكس ۱۰۰ مل شراب العالمية لاكسولاك', 'product_id' => 147],
                    ['bill_number' => 670382, 'ex' => '', 'u_cost' => 2550,  'qt' => 1, 'n' => 'هايبين ٥٠٠مل اقراص الجبل أموكسيل ۱۰ ش', 'product_id' => 148],
                ]
            ],
            [
                'bill_number' => 670349,
                'data' =>
                [
                    ['ex' => '', 'u_cost' => 1100, 'bill_number' => 670349, 'qt' => 5, 'n' => 'بیمناست ۱۰۰۰ ملجم فيال العربية فوربار', 'product_id' => 149],
                    ['ex' => '', 'u_cost' => 510, 'bill_number' => 670349, 'qt' => 20, 'n' => 'زوراكسون ۱۰۰۰ ملجم وريدي الفتح فورسيف', 'product_id' => 150],
                    ['ex' => '', 'u_cost' => 510, 'bill_number' => 670349, 'qt' => 10, 'n' => 'سيفوران 1 جرام فيال فارکو اور تاکسیم', 'product_id' => 151],
                    ['ex' => '', 'u_cost' => 830, 'bill_number' => 670349, 'qt' => 5, 'n' => 'باراسيتامول قرب برفلجان فاركو', 'product_id' => 152],
                    ['ex' => '', 'u_cost' => 680, 'bill_number' => 670349, 'qt' => 10, 'n' => 'اور تکسیم اجرام فيال الجبل', 'product_id' => 153],
                    ['ex' => '', 'u_cost' => 1380, 'bill_number' => 670349, 'qt' => 5, 'n' => 'سيفتاد ۱۰۰۰ قيال فوربار الجبل', 'product_id' => 154],
                    ['ex' => '', 'u_cost' => 1765, 'bill_number' => 670349, 'qt' => 5, 'n' => 'قوربار اجرام فيال سيبلا', 'product_id' => 155],
                    ['ex' => '', 'u_cost' => 2070, 'bill_number' => 670349, 'qt' => 3, 'n' => 'انسولين اتش بيو ار فيال أصفر) سيديكو الحارث', 'product_id' => 156],
                    ['ex' => '', 'u_cost' => 1950, 'bill_number' => 670349, 'qt' => 4, 'n' => 'هيبارين صوديوم ٥٠٠٠ وحدة عبوة 3 أمبولات جديد الحارث', 'product_id' => 157],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 670349, 'qt' => 5, 'n' => 'سيبروفلوكساسين محلول العافية سيبلوكس', 'product_id' => 158],
                    ['ex' => '', 'u_cost' => 630, 'bill_number' => 670349, 'qt' => 5, 'n' => 'ديكساميتازون امبول فلهوم', 'product_id' => 159],
                    ['ex' => '', 'u_cost' => 590, 'bill_number' => 670349, 'qt' => 5, 'n' => 'زجاج برفلجان قرب زجاج فلهوم', 'product_id' => 160],
                    ['ex' => '', 'u_cost' => 190, 'bill_number' => 670349, 'qt' => 20, 'n' => 'ديكستروز ٤٠% امبول رويال فارما بالحبه الواحده', 'product_id' => 161],
                    ['ex' => '', 'u_cost' => 680, 'bill_number' => 670349, 'qt' => 5, 'n' => 'براسيتامول مغنيات زجاج رويال بر فلجان رویامول', 'product_id' => 162],
                    ['ex' => '', 'u_cost' => 440, 'bill_number' => 670349, 'qt' => 5, 'n' => 'اقيل امبول رويال فارما', 'product_id' => 163],
                    ['ex' => '', 'u_cost' => 540, 'bill_number' => 670349, 'qt' => 5, 'n' => 'بليمازول امبول رويال فارما ريمو بلازا', 'product_id' => 164],
                    ['ex' => '', 'u_cost' => 530, 'bill_number' => 670349, 'qt' => 3, 'n' => 'بي كومبلكس أمبول رويال فارما', 'product_id' => 165],
                    ['ex' => '', 'u_cost' => 380, 'bill_number' => 670349, 'qt' => 3, 'n' => 'فيتامين سي أمبول ٥٠٠ رويال فارما', 'product_id' => 166],
                    ['ex' => '', 'u_cost' => 520, 'bill_number' => 670349, 'qt' => 5, 'n' => 'جنتاميسين أمبول ۸۰ ملجم رويال فارما', 'product_id' => 167],
                    ['ex' => '', 'u_cost' => 660, 'bill_number' => 670349, 'qt' => 10, 'n' => 'متريندازول قرب جال فارما فلاجيل بدون موصل', 'product_id' => 168],
                    ['ex' => '', 'u_cost' => 2290, 'bill_number' => 670349, 'qt' => 5, 'n' => 'انترابيم قيال مياس 1 جرام سيفبيم قوربار', 'product_id' => 169],
                    ['ex' => '', 'u_cost' => 1530, 'bill_number' => 670349, 'qt' => 5, 'n' => 'باراكونيكا اجرام فيال محلات مياس برفلجان', 'product_id' => 170],
                    ['ex' => '', 'u_cost' => 8550, 'bill_number' => 670349, 'qt' => 1, 'n' => 'كمبونينت فيال ۲۰ ف أرض الجنتين كومبيفيت', 'product_id' => 171],
                    ['ex' => '', 'u_cost' => 1180, 'bill_number' => 670349, 'qt' => 4, 'n' => 'دوبروس ۲۰۰ مل امبول دوبامين بعوم', 'product_id' => 172],
                    ['ex' => '', 'u_cost' => 6430, 'bill_number' => 670349, 'qt' => 3, 'n' => 'وکیل مختوم تینام ٥٠٠ ملجم بان مبنيم مهدي الشاعر', 'product_id' => 173],
                    ['ex' => '', 'u_cost' => 4030, 'bill_number' => 670349, 'qt' => 5, 'n' => 'فانكومايسين اجرام فيال الشاعر فانكولون ۱۰۰۰', 'product_id' => 174],
                    ['ex' => '', 'u_cost' => 1280, 'bill_number' => 670349, 'qt' => 5, 'n' => 'ستو بالجيك برفلجان بارستامول مغنية الشاعر', 'product_id' => 175],
                    ['ex' => '', 'u_cost' => 450, 'bill_number' => 670349, 'qt' => 5, 'n' => 'سيبروفلوكساسين قرب الجيش سيبلوكس سيبروكيد', 'product_id' => 176],
                    ['ex' => '', 'u_cost' => 499, 'bill_number' => 670349, 'qt' => 20, 'n' => 'سيبلاسيف اجرام فيال سيبلا', 'product_id' => 177],
                    ['ex' => '', 'u_cost' => 519, 'bill_number' => 670349, 'qt' => 10, 'n' => 'سيبلاسيف ٥٠٠ ملجم فيال سيبلا', 'product_id' => 178],
                    ['ex' => '', 'u_cost' => 5150, 'bill_number' => 670349, 'qt' => 3, 'n' => 'سیلاكيب ٥٠٠ جرام فيال تينام رسام الشاعر', 'product_id' => 179],
                    ['ex' => '', 'u_cost' => 4400, 'bill_number' => 670349, 'qt' => 4, 'n' => 'موبيم ا مجم فيال رسام الشاعر میرونیم مورنیم بدون مرتجع', 'product_id' => 180],
                    ['ex' => '', 'u_cost' => 3300, 'bill_number' => 670349, 'qt' => 2, 'n' => 'دايميد ۲۰ منجم امبول الربيعي ديتور ١٠ امبول', 'product_id' => 181],
                    ['ex' => '', 'u_cost' => 360, 'bill_number' => 670349, 'qt' => 30, 'n' => 'سكر مغنيات الجبل', 'product_id' => 182],
                    ['ex' => '', 'u_cost' => 370, 'bill_number' => 670349, 'qt' => 30, 'n' => 'رنجر مغذيات الجبل', 'product_id' => 183],
                    ['ex' => '', 'u_cost' => 310, 'bill_number' => 670349, 'qt' => 10, 'n' => ' فلاجيل قرب مع الموصلات اميال فارما بدون مرتجع', 'product_id' => 184],
                    ['ex' => '', 'u_cost' => 580, 'bill_number' => 670349, 'qt' => 10, 'n' => ' روها ليفوفلوكساسين قرب ۱۰۰ مل روها فارما معى الموصل ليلوباكت', 'product_id' => 185],
                    ['ex' => '', 'u_cost' => 340, 'bill_number' => 670349, 'qt' => 5, 'n' => ' روها سيبروفلوكساسين قرب ۱۰۰ مل روها فارما معى الموصل سيبلوكس', 'product_id' => 186],
                    ['ex' => '', 'u_cost' => 1690, 'bill_number' => 670349, 'qt' => 3, 'n' => ' اوندر يسترون امبول ۸ ملجم صادق البرحي ايمست', 'product_id' => 187],
                    ['ex' => '', 'u_cost' => 4940, 'bill_number' => 670349, 'qt' => 4, 'n' => ' سالاتاز ٤٥ فيال الأمل تاركت', 'product_id' => 188],
                    ['ex' => '', 'u_cost' => 1550, 'bill_number' => 670349, 'qt' => 4, 'n' => ' لازكس امبول الصباري', 'product_id' => 189],
                    ['ex' => '', 'u_cost' => 320, 'bill_number' => 670349, 'qt' => 10, 'n' => ' هيتاسون ۱۰۰ ملجم فيال فارما بيدا هيدروكرتزون', 'product_id' => 190],
                    ['ex' => '', 'u_cost' => 870, 'bill_number' => 670349, 'qt' => 3, 'n' => ' بروسيوم ١٠ امبول امبولات فارما بيدا مغناسيوم', 'product_id' => 191],
                    ['ex' => '', 'u_cost' => 290, 'bill_number' => 670349, 'qt' => 20, 'n' => ' سيفتر یاکسون أكوي اجم فيال تعافي فارما سي ون سيبلاسيف', 'product_id' => 192],
                    ['ex' => '', 'u_cost' => 3300, 'bill_number' => 670349, 'qt' => 4, 'n' => ' نازکت کوزمابيتاز ٤,٥ ملجم قرب الجيش تازكت', 'product_id' => 193],
                    ['ex' => '', 'u_cost' => 290, 'bill_number' => 670349, 'qt' => 10, 'n' => ' كورما تكسي اجرام فيال اور تكسيم سيفوتاكسيم الجيش و', 'product_id' => 194],
                    ['ex' => '', 'u_cost' => 6100, 'bill_number' => 670349, 'qt' => 1, 'n' => ' ديتور امبول عبوة ۲۰ امبوله ابوزيد سيبلا ٢٠ أم', 'product_id' => 195],
                    ['ex' => '', 'u_cost' => 5300, 'bill_number' => 670349, 'qt' => 3, 'n' => ' ميراكوي اجم فيال تعافي فارما ميرونيم', 'product_id' => 196],
                    ['ex' => '', 'u_cost' => 2550, 'bill_number' => 670349, 'qt' => 5, 'n' => ' افسيناف اجم فيال فانكومايسين تعافي فارما', 'product_id' => 197],
                    ['ex' => '', 'u_cost' => 3300, 'bill_number' => 670349, 'qt' => 3, 'n' => ' اینوکس بارين ٤٠٠٠ و دتعافي فارما ٢ أمبول', 'product_id' => 198],
                    ['ex' => '', 'u_cost' => 4300, 'bill_number' => 670349, 'qt' => 3, 'n' => ' اینو كسبارين ٦٠٠٠ و دتعافي فارما ٢ امبول', 'product_id' => 199],
                    ['ex' => '', 'u_cost' => 2800, 'bill_number' => 670349, 'qt' => 10, 'n' => ' کابرین ۲۵۰۰۰ و.د فيال فارما بيوتك هيبارين', 'product_id' => 200],
                    ['ex' => '', 'u_cost' => 3700, 'bill_number' => 670349, 'qt' => 120, 'n' => ' ملح مغنيات القطريفي', 'product_id' => 201],
                    ['ex' => '', 'u_cost' => 3700, 'bill_number' => 670349, 'qt' => 48, 'n' => ' مخلوط مغذيات القطريفي', 'product_id' => 202],
                    ['ex' => '', 'u_cost' => 1960, 'bill_number' => 670349, 'qt' => 5, 'n' => ' فانكوبال ۱۰۰۰ ملجم فيال أميال فانكوميسين', 'product_id' => 203],
                    ['ex' => '', 'u_cost' => 1300, 'bill_number' => 670349, 'qt' => 10, 'n' => ' سوكسيبال مغذيات اميال فارما موكساسيب', 'product_id' => 204],
                    ['ex' => '', 'u_cost' => 725, 'bill_number' => 670349, 'qt' => 10, 'n' => ' فير سدرين ٢ ملي أمبول لازكس بريميم ديرين', 'product_id' => 205],
                    ['ex' => '', 'u_cost' => 1550, 'bill_number' => 670349, 'qt' => 3, 'n' => ' درسترون ۲ ملي أمبول ايمست بریمیم دیرین', 'product_id' => 206],
                    ['ex' => '', 'u_cost' => 3050, 'bill_number' => 670349, 'qt' => 3, 'n' => ' ليفيتام ٥٠٠ ملجم فيال كيبرا بیوسنسورس بيواكتف', 'product_id' => 207],
                    ['ex' => '', 'u_cost' => 5000, 'bill_number' => 670349, 'qt' => 2, 'n' => ' فاتكولون ۱۰۰۰ ملجم فيال جلفار', 'product_id' => 208],
                    ['ex' => '', 'u_cost' => 280, 'bill_number' => 670349, 'qt' => 10, 'n' => ' روها میترندازول ۱۰۰ ما قرب روها فارما معى الموصل فلاجيل', 'product_id' => 209],
                ]
            ],
            [

                'bill_number' => 1525,
                'data' =>
                [
                    ['ex' => '', 'u_cost' => 580, 'bill_number' => 1525, 'qt' => 20, 'n' => 'قساطر سلكون مقاس 16', 'product_id' => 210],
                    ['ex' => '', 'u_cost' => 580, 'bill_number' => 1525, 'qt' => 20, 'n' => 'قساطر سلكون مقاس 14', 'product_id' => 211],
                    ['ex' => '', 'u_cost' => 580, 'bill_number' => 1525, 'qt' => 10, 'n' => 'قساطر سلكون مقاس 12', 'product_id' => 212],
                    ['ex' => '', 'u_cost' => 750, 'bill_number' => 1525, 'qt' => 10, 'n' => 'قساطر سلكون ابو 10', 'product_id' => 213],
                    ['ex' => '', 'u_cost' => 750, 'bill_number' => 1525, 'qt' => 10, 'n' => 'قساطر سلكون مقاس 6', 'product_id' => 214],
                    ['ex' => '', 'u_cost' => 750, 'bill_number' => 1525, 'qt' => 10, 'n' => 'قساطر سلكون مقاس 8', 'product_id' => 215],
                    ['ex' => '', 'u_cost' => 110, 'bill_number' => 1525, 'qt' => 20, 'n' => 'قرب بول', 'product_id' => 216],
                    ['ex' => '', 'u_cost' => 1100, 'bill_number' => 1525, 'qt' => 5, 'n' => 'شاش معقم 10*10 عبوة 50', 'product_id' => 217],
                    ['ex' => '', 'u_cost' => 6500, 'bill_number' => 1525, 'qt' => 3, 'n' => 'جلفز معقم ماليزي 7.5', 'product_id' => 218],
                    ['ex' => '', 'u_cost' => 170, 'bill_number' => 1525, 'qt' => 20, 'n' => 'رایز تیوب مقاس 16', 'product_id' => 219],
                    ['ex' => '', 'u_cost' => 170, 'bill_number' => 1525, 'qt' => 20, 'n' => 'رايز تيوب مقاس 14', 'product_id' => 220],
                    ['ex' => '', 'u_cost' => 170, 'bill_number' => 1525, 'qt' => 10, 'n' => 'رایز تیوب مقاس 12', 'product_id' => 221],
                    ['ex' => '', 'u_cost' => 6200, 'bill_number' => 1525, 'qt' => 3, 'n' => 'سنتر لاين مقاس 7', 'product_id' => 222],
                    ['ex' => '', 'u_cost' => 7500, 'bill_number' => 1525, 'qt' => 1, 'n' => 'سنتر لاين مقاس 3', 'product_id' => 223],
                    ['ex' => '', 'u_cost' => 200, 'bill_number' => 1525, 'qt' => 20, 'n' => 'قطن ابو 50 جرام', 'product_id' => 224],
                    ['ex' => '', 'u_cost' => 170, 'bill_number' => 1525, 'qt' => 10, 'n' => 'رايز تيوب مقاس 8', 'product_id' => 225],
                    ['ex' => '', 'u_cost' => 170, 'bill_number' => 1525, 'qt' => 10, 'n' => 'فيدنق تيوب 10', 'product_id' => 226],
                ]
            ],
            [

                'bill_number' => 1526,
                'data' =>
                [
                    ['ex' => '', 'u_cost' => 300, 'bill_number' => 1526, 'qt' => 20, 'n' => 'قطن ابو 100 جرام', 'product_id' => 227],
                    ['ex' => '', 'u_cost' => 1200, 'bill_number' => 1526, 'qt' => 5, 'n' => 'قطن 500 جرام', 'product_id' => 228],
                    ['ex' => '', 'u_cost' => 2400, 'bill_number' => 1526, 'qt' => 2, 'n' => 'قطن ابو 1000 جرام', 'product_id' => 229],
                    ['ex' => '', 'u_cost' => 680, 'bill_number' => 1526, 'qt' => 5, 'n' => 'قطن ابو 250', 'product_id' => 230],
                    ['ex' => '', 'u_cost' => 250, 'bill_number' => 1526, 'qt' => 10, 'n' => 'كمام اكسجين اسمول', 'product_id' => 231],
                    ['ex' => '', 'u_cost' => 250, 'bill_number' => 1526, 'qt' => 10, 'n' => 'كمام اكسجين مديم', 'product_id' => 232],
                    ['ex' => '', 'u_cost' => 250, 'bill_number' => 1526, 'qt' => 10, 'n' => 'كمام اكسجين كبار', 'product_id' => 233],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1526, 'qt' => 10, 'n' => 'كمام نيو بليزر اسمول', 'product_id' => 234],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1526, 'qt' => 20, 'n' => 'كمام نيو بليزر لارج', 'product_id' => 235],
                    ['ex' => '', 'u_cost' => 120, 'bill_number' => 1526, 'qt' => 75, 'n' => 'اندر باد صيني عبوة 25', 'product_id' => 236],
                    ['ex' => '', 'u_cost' => 3000, 'bill_number' => 1526, 'qt' => 5, 'n' => 'سركت تخدير اطفال', 'product_id' => 237],
                    ['ex' => '', 'u_cost' => 1400, 'bill_number' => 1526, 'qt' => 5, 'n' => 'سركت تخدير كبار', 'product_id' => 238],
                    ['ex' => '', 'u_cost' => 3000, 'bill_number' => 1526, 'qt' => 5, 'n' => 'شرکت تخدير ابو فلترين', 'product_id' => 239],
                    ['ex' => '', 'u_cost' => 400, 'bill_number' => 1526, 'qt' => 10, 'n' => 'مكرو دروب ابو 150', 'product_id' => 240],
                    ['ex' => '', 'u_cost' => 380, 'bill_number' => 1526, 'qt' => 10, 'n' => 'موصلات تقطير', 'product_id' => 241],
                    ['ex' => '', 'u_cost' => 200, 'bill_number' => 1526, 'qt' => 10, 'n' => 'موصلات قرب دم', 'product_id' => 242],
                    ['ex' => '', 'u_cost' => 60, 'bill_number' => 1526, 'qt' => 5, 'n' => 'سكشن تيوب مقاس 10', 'product_id' => 243],
                ]
            ],
            [
                'bill_number' => 1528,
                'data' =>
                [
                    ['ex' => '', 'u_cost' => 1700, 'bill_number' => 1528, 'qt' => 1, 'n' => 'سيرنج 5 مل', 'product_id' => 244],
                    ['ex' => '', 'u_cost' => 2700, 'bill_number' => 1528, 'qt' => 1, 'n' => 'سيرنج 20 مل', 'product_id' => 245],
                    ['ex' => '', 'u_cost' => 1700, 'bill_number' => 1528, 'qt' => 1, 'n' => 'سيرنج 3 مل', 'product_id' => 246],
                    ['ex' => '', 'u_cost' => 2700, 'bill_number' => 1528, 'qt' => 1, 'n' => 'سيرنج ابو 10', 'product_id' => 247],
                    ['ex' => '', 'u_cost' => 3800, 'bill_number' => 1528, 'qt' => 1, 'n' => 'سيرنج ابو 50 تغذية', 'product_id' => 248],
                    ['ex' => '', 'u_cost' => 3800, 'bill_number' => 1528, 'qt' => 1, 'n' => 'سيرنج ابو 50 مل', 'product_id' => 249],
                    ['ex' => '', 'u_cost' => 1200, 'bill_number' => 1528, 'qt' => 1, 'n' => 'خيوط سلك اسباني كتنج مقاس 2.0', 'product_id' => 250],
                    ['ex' => '', 'u_cost' => 12500, 'bill_number' => 1528, 'qt' => 1, 'n' => 'كاثيولا 26', 'product_id' => 251],
                    ['ex' => '', 'u_cost' => 11800, 'bill_number' => 1528, 'qt' => 1, 'n' => 'كاثيولا مقاس 24 قصير', 'product_id' => 252],
                    ['ex' => '', 'u_cost' => 380, 'bill_number' => 1528, 'qt' => 5, 'n' => 'ثري وي', 'product_id' => 253],
                    ['ex' => '', 'u_cost' => 1500, 'bill_number' => 1528, 'qt' => 8, 'n' => 'جلفز لاتكس ماليزي مع البودر اسمول', 'product_id' => 254],
                    ['ex' => '', 'u_cost' => 1500, 'bill_number' => 1528, 'qt' => 2, 'n' => 'الكترود ECG', 'product_id' => 255],
                    ['ex' => '', 'u_cost' => 2700, 'bill_number' => 1528, 'qt' => 1, 'n' => 'الكترود ECG', 'product_id' => 256],
                    ['ex' => '', 'u_cost' => 90, 'bill_number' => 1528, 'qt' => 80, 'n' => 'کاندم بول L', 'product_id' => 257],
                    ['ex' => '', 'u_cost' => 60, 'bill_number' => 1528, 'qt' => 60, 'n' => 'الصق عجل مقاس 2.51', 'product_id' => 258],
                    ['ex' => '', 'u_cost' => 120, 'bill_number' => 1528, 'qt' => 60, 'n' => 'الصق عجل مقاس 2.53', 'product_id' => 259],
                ]
            ],
            [
                'bill_number' => 1529,
                'data' =>
                [
                    ['ex' => '', 'u_cost' => 900, 'bill_number' => 1529, 'qt' => 2, 'n' => 'لصق عمليات 1010 عبوة 25', 'product_id' => 260],
                    ['ex' => '', 'u_cost' => 2200, 'bill_number' => 1529, 'qt' => 1, 'n' => 'لصق عمليات 1510 عبوة 50', 'product_id' => 261],
                    ['ex' => '', 'u_cost' => 4800, 'bill_number' => 1529, 'qt' => 1, 'n' => 'الصق عمليات 3010 عبوة 50', 'product_id' => 262],
                    ['ex' => '', 'u_cost' => 1200, 'bill_number' => 1529, 'qt' => 5, 'n' => 'جلفز فينال ابيض مقاس مديم M', 'product_id' => 263],
                    ['ex' => '', 'u_cost' => 300, 'bill_number' => 1529, 'qt' => 5, 'n' => 'فاین مبلل', 'product_id' => 264],
                    ['ex' => '', 'u_cost' => 500, 'bill_number' => 1529, 'qt' => 5, 'n' => 'فاين مبلل كبير', 'product_id' => 265],
                    ['ex' => '', 'u_cost' => 400, 'bill_number' => 1529, 'qt' => 5, 'n' => 'فاین مبلل وسط', 'product_id' => 266],
                    ['ex' => '', 'u_cost' => 110, 'bill_number' => 1529, 'qt' => 12, 'n' => 'رباط ضاغط مقاس 310', 'product_id' => 267],
                    ['ex' => '', 'u_cost' => 150, 'bill_number' => 1529, 'qt' => 12, 'n' => 'رباط ضاغط مقاس 15', 'product_id' => 268],
                    ['ex' => '', 'u_cost' => 80, 'bill_number' => 1529, 'qt' => 12, 'n' => 'رباط ضاغط مقاس 7.5', 'product_id' => 269],
                    ['ex' => '', 'u_cost' => 300, 'bill_number' => 1529, 'qt' => 1, 'n' => 'كمام ربل', 'product_id' => 270],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1529, 'qt' => 6, 'n' => 'اندر تركل تيوب مع الكف 2.5', 'product_id' => 271],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1529, 'qt' => 3, 'n' => 'اندر تركل تيوب مع الكف 3.5', 'product_id' => 272],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1529, 'qt' => 3, 'n' => 'اندر تركل تيوب مع الكف 4', 'product_id' => 273],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1529, 'qt' => 3, 'n' => 'اندر تركل تيوب مع الكف 6', 'product_id' => 274],
                    ['ex' => '', 'u_cost' => 350, 'bill_number' => 1529, 'qt' => 6, 'n' => 'اندر تركل تيوب مع الكف 7', 'product_id' => 275],
                    ['ex' => '', 'u_cost' => 65, 'bill_number' => 1529, 'qt' => 7, 'n' => 'فيدنق تيوب 6', 'product_id' => 276],
                    ['ex' => '', 'u_cost' => 65, 'bill_number' => 1529, 'qt' => 3, 'n' => 'فيدنق تيوب 6', 'product_id' => 277],
                    ['ex' => '', 'u_cost' => 60, 'bill_number' => 1529, 'qt' => 20, 'n' => 'سكشن تيوب مقاس 6', 'product_id' => 278],
                    ['ex' => '', 'u_cost' => 3000, 'bill_number' => 1529, 'qt' => 1, 'n' => 'سيرنج أبو 1 انسولين', 'product_id' => 279],
                    ['ex' => '', 'u_cost' => 150, 'bill_number' => 1529, 'qt' => 20, 'n' => 'نازل اكسجين لارج', 'product_id' => 280],
                    ['ex' => '', 'u_cost' => 50, 'bill_number' => 1529, 'qt' => 20, 'n' => 'علب براز معقم', 'product_id' => 281],
                    ['ex' => '', 'u_cost' => 180, 'bill_number' => 1529, 'qt' => 5, 'n' => 'ثري وي', 'product_id' => 282],
                ]
            ],
            [
                'bill_number' => 2476,
                'data' =>
                [
                    ['ex' => '', 'u_cost' => 3980, 'bill_number' => 2476, 'qt' => 4, 'n' => 'بيبي جوي رقم واحد مواليد 66', 'product_id' => 1],
                    ['ex' => '', 'u_cost' => 4370, 'bill_number' => 2476, 'qt' => 1, 'n' => 'بيبي جوي رقم 483', 'product_id' => 2],
                    ['ex' => '', 'u_cost' => 4220, 'bill_number' => 2476, 'qt' => 3, 'n' => 'بيبي جوي رقم 2 66', 'product_id' => 3],
                    ['ex' => '', 'u_cost' => 4370, 'bill_number' => 2476, 'qt' => 3, 'n' => 'بيبي جوي عائلي عبوه 44 رقم 4', 'product_id' => 4],
                    ['ex' => '', 'u_cost' => 2750, 'bill_number' => 2476, 'qt' => 4, 'n' => 'كونفي مواليد رقم 1 44', 'product_id' => 5],
                    ['ex' => '', 'u_cost' => 4300, 'bill_number' => 2476, 'qt' => 2, 'n' => 'كونفي رقم 702', 'product_id' => 6],
                    ['ex' => '', 'u_cost' => 4300, 'bill_number' => 2476, 'qt' => 3, 'n' => 'كونفي رقم 603', 'product_id' => 7],
                    ['ex' => '', 'u_cost' => 4300, 'bill_number' => 2476, 'qt' => 3, 'n' => 'كونفي رقم 4 50', 'product_id' => 8],
                    ['ex' => '', 'u_cost' => 360, 'bill_number' => 2476, 'qt' => 4, 'n' => 'مناديل مبلله دادي عبوه 72', 'product_id' => 9],
                    ['ex' => '', 'u_cost' => 500, 'bill_number' => 2476, 'qt' => 4, 'n' => 'مناديل مبلله زين عبوه 120 حبه', 'product_id' => 10],
                    ['ex' => '', 'u_cost' => 770, 'bill_number' => 2476, 'qt' => 10, 'n' => 'فاين قل عايلي 1300 الاصفر', 'product_id' => 11],
                    ['ex' => '', 'u_cost' => 3250, 'bill_number' => 2476, 'qt' => 4, 'n' => 'حليب فرانس ليه رقم 1', 'product_id' => 12],
                    ['ex' => '', 'u_cost' => 3250, 'bill_number' => 2476, 'qt' => 4, 'n' => 'حليب فرانس ليه رقم 2', 'product_id' => 13],
                    ['ex' => '', 'u_cost' => 3040, 'bill_number' => 2476, 'qt' => 4, 'n' => 'حليب رجلاك رقم 1', 'product_id' => 14],
                    ['ex' => '', 'u_cost' => 3040, 'bill_number' => 2476, 'qt' => 4, 'n' => 'حليب رجلاك رقم 2', 'product_id' => 15],
                    ['ex' => '', 'u_cost' => 3250, 'bill_number' => 2476, 'qt' => 4, 'n' => 'حليب رجلاك رقم 3', 'product_id' => 16],
                    ['ex' => '', 'u_cost' => 3300, 'bill_number' => 2476, 'qt' => 4, 'n' => 'حليب فرانس ليه رقم 3', 'product_id' => 17],
                    ['ex' => '', 'u_cost' => 300, 'bill_number' => 2476, 'qt' => 10, 'n' => 'رز مصری غذام', 'product_id' => 18],
                    ['ex' => '', 'u_cost' => 485, 'bill_number' => 2476, 'qt' => 7, 'n' => 'بسكويت بسكي اطفال .', 'product_id' => 19],
                    ['ex' => '', 'u_cost' => 650, 'bill_number' => 2476, 'qt' => 7, 'n' => 'سيرلاك غذاء مبكت منوع.', 'product_id' => 20],
                    ['ex' => '', 'u_cost' => 95, 'bill_number' => 2476, 'qt' => 10, 'n' => 'اعواد اذان خشب 100', 'product_id' => 21],
                    ['ex' => '', 'u_cost' => 210, 'bill_number' => 2476, 'qt' => 10, 'n' => 'اعواد اذن خشب صيني 200 حبه خليل كبير', 'product_id' => 22],
                    ['ex' => '', 'u_cost' => 640, 'bill_number' => 2476, 'qt' => 8, 'n' => 'معجون دابر بالأعشاب مع الفرشاة', 'product_id' => 23],
                    ['ex' => '', 'u_cost' => 325, 'bill_number' => 2476, 'qt' => 5, 'n' => 'سجنال معجون وسط الاصلي', 'product_id' => 24],
                    ['ex' => '', 'u_cost' => 190, 'bill_number' => 2476, 'qt' => 5, 'n' => 'معجون سجنال صغير اصلي', 'product_id' => 25],
                    ['ex' => '', 'u_cost' => 595, 'bill_number' => 2476, 'qt' => 3, 'n' => 'معجون سجنال كبير سعودي 125 مل', 'product_id' => 26],
                    ['ex' => '', 'u_cost' => 1650, 'bill_number' => 2476, 'qt' => 1, 'n' => 'فرش استان سبتادینت', 'product_id' => 27],
                    ['ex' => '', 'u_cost' => 190, 'bill_number' => 2476, 'qt' => 20, 'n' => 'فرش اسنان سيلكون الأصلي دكتور', 'product_id' => 28],
                    ['ex' => '', 'u_cost' => 950, 'bill_number' => 2476, 'qt' => 1, 'n' => 'فرش اطفال اورنج ابو غطا', 'product_id' => 29],
                    ['ex' => '', 'u_cost' => 290, 'bill_number' => 2476, 'qt' => 10, 'n' => 'صابون جونسون اطفال جديد', 'product_id' => 30],
                    ['ex' => '', 'u_cost' => 650, 'bill_number' => 2476, 'qt' => 5, 'n' => 'صابون مينا بابايا', 'product_id' => 31],
                    ['ex' => '', 'u_cost' => 400, 'bill_number' => 2476, 'qt' => 5, 'n' => 'صابون ديتول كبير اصلي', 'product_id' => 32],
                    ['ex' => '', 'u_cost' => 220, 'bill_number' => 2476, 'qt' => 5, 'n' => 'صابون لوكس صغير', 'product_id' => 33],
                    ['ex' => '', 'u_cost' => 220, 'bill_number' => 2476, 'qt' => 5, 'n' => 'صابون لايفبوي سعودي صغير', 'product_id' => 34],
                    ['ex' => '', 'u_cost' => 395, 'bill_number' => 2476, 'qt' => 5, 'n' => 'صابون دوف صغير المالي', 'product_id' => 35],
                    ['ex' => '', 'u_cost' => 480, 'bill_number' => 2476, 'qt' => 5, 'n' => 'رضاعات الامير كبير', 'product_id' => 36],
                    ['ex' => '', 'u_cost' => 200, 'bill_number' => 2476, 'qt' => 5, 'n' => 'رضاعات مواليد الأمير 60 ملي', 'product_id' => 37],
                    ['ex' => '', 'u_cost' => 480, 'bill_number' => 2476, 'qt' => 5, 'n' => 'رضاعات بتاتو وسط معتم 150 مل', 'product_id' => 38],
                    ['ex' => '', 'u_cost' => 380, 'bill_number' => 2476, 'qt' => 5, 'n' => 'زيت الزيتون المروى', 'product_id' => 39],
                    ['ex' => '', 'u_cost' => 400, 'bill_number' => 2476, 'qt' => 5, 'n' => 'زيت الزيتون ليدي بلاص 175 مل', 'product_id' => 40],
                    ['ex' => '', 'u_cost' => 880, 'bill_number' => 2476, 'qt' => 3, 'n' => '- زيت جونسون اطفال الاصلي 200 مل', 'product_id' => 41],
                    ['ex' => '', 'u_cost' => 500, 'bill_number' => 2476, 'qt' => 5, 'n' => 'زيت اطفال بيدا 200 مل', 'product_id' => 42],
                    ['ex' => '', 'u_cost' => 1200, 'bill_number' => 2476, 'qt' => 5, 'n' => '- زيت نونو 200 مل', 'product_id' => 43],
                    ['ex' => '', 'u_cost' => 580, 'bill_number' => 2476, 'qt' => 5, 'n' => 'بودره كوبر 400 جرام مع شامبو 100 مل دعايه', 'product_id' => 44],
                    ['ex' => '', 'u_cost' => 290, 'bill_number' => 2476, 'qt' => 5, 'n' => 'بودره كوبر صغير شامبو دعايه 50 مل', 'product_id' => 45],
                    ['ex' => '', 'u_cost' => 730, 'bill_number' => 2476, 'qt' => 5, 'n' => 'بودره كوبر كبير 600 مع شامبو 100 مل دعايه', 'product_id' => 46],
                    ['ex' => '', 'u_cost' => 380, 'bill_number' => 2476, 'qt' => 5, 'n' => 'بودره كوبر وسط 200 مع شامبو 50 مل دعايه', 'product_id' => 47],
                    ['ex' => '', 'u_cost' => 545, 'bill_number' => 2476, 'qt' => 3, 'n' => 'شحم كوبرا 180 جرام وسط', 'product_id' => 48],
                    ['ex' => '', 'u_cost' => 6500, 'bill_number' => 2476, 'qt' => 2, 'n' => 'حفاضات لاكي بالغين كبير 30 حبة', 'product_id' => 49],
                    ['ex' => '', 'u_cost' => 5900, 'bill_number' => 2476, 'qt' => 2, 'n' => 'حفاضات لاكي بالغين وسط 30 حبة', 'product_id' => 50],
                    ['ex' => '', 'u_cost' => 545, 'bill_number' => 2476, 'qt' => 5, 'n' => 'شحم كوبرا 180 جرام وسط', 'product_id' => 51],
                    ['ex' => '', 'u_cost' => 175, 'bill_number' => 2476, 'qt' => 5, 'n' => 'شحم كوبر صغير جدا 45 جرام', 'product_id' => 52],
                    ['ex' => '', 'u_cost' => 640, 'bill_number' => 2476, 'qt' => 3, 'n' => 'زيت فاتيكا منوع صغير', 'product_id' => 53],
                    ['ex' => '', 'u_cost' => 1020, 'bill_number' => 2476, 'qt' => 3, 'n' => 'زيت فاتيكا منوع كبير', 'product_id' => 54],
                    ['ex' => '', 'u_cost' => 280, 'bill_number' => 2476, 'qt' => 5, 'n' => 'شامبو اطفال بيبي شوف 100 ملي', 'product_id' => 55],
                    ['ex' => '', 'u_cost' => 385, 'bill_number' => 2476, 'qt' => 5, 'n' => 'شامبو اطفال بيبي شوف 200 ملي', 'product_id' => 56],
                    ['ex' => '', 'u_cost' => 1100, 'bill_number' => 2476, 'qt' => 5, 'n' => 'شامبو اطفال بيبي شوف 800 ملى -', 'product_id' => 57],
                    ['ex' => '', 'u_cost' => 1700, 'bill_number' => 2476, 'qt' => 2, 'n' => 'نيقياء ألماني كبير 250 جرام', 'product_id' => 58],
                    ['ex' => '', 'u_cost' => 1200, 'bill_number' => 2476, 'qt' => 2, 'n' => 'نيفياء ألماني وسط', 'product_id' => 59],
                    ['ex' => '', 'u_cost' => 1450, 'bill_number' => 2476, 'qt' => 2, 'n' => 'كريم جليسوليد كبير', 'product_id' => 60],
                    ['ex' => '', 'u_cost' => 945, 'bill_number' => 2476, 'qt' => 2, 'n' => 'گریم جليسوليد وسط', 'product_id' => 61],
                    ['ex' => '', 'u_cost' => 695, 'bill_number' => 2476, 'qt' => 2, 'n' => 'كريم جليسوليد صغير مع الاضافة', 'product_id' => 62],
                    ['ex' => '', 'u_cost' => 1200, 'bill_number' => 2476, 'qt' => 1, 'n' => 'لصقة عمليات 55 عبوة 50 سران', 'product_id' => 63],
                    ['ex' => '', 'u_cost' => 2000, 'bill_number' => 2476, 'qt' => 1, 'n' => 'لصق عمليات 2010 عبوه 25', 'product_id' => 64],
                    ['ex' => '', 'u_cost' => 3950, 'bill_number' => 2476, 'qt' => 11, 'n' => 'لصق عمليات تايجر 2510', 'product_id' => 65],
                    ['ex' => '', 'u_cost' => 1000, 'bill_number' => 2476, 'qt' => 5, 'n' => 'غذاء ريرى بدون مرتجع', 'product_id' => 66],
                ]
            ]
        ];
        foreach ($data as $bill){
            $this->createProductInput($bill);
        }
    }
}
