<?php

namespace Database\Seeders;

use App\Models\Products\Product;
use App\Models\Sales\SaleHeader;
use App\Models\Store\ProductInput;
use App\Models\Store\ProductInputHeader;
use App\Models\User;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\PaymentType;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    public string $qerbah = 'قربة';
    public string $backet = 'باكت';
    public string $vialah = 'فيالة';
    public string $ambola = 'امبولة';

    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        $this->bil2476();
        $this->bil670382();
        $this->bil670349();
    }

    public function createBill(int $bill_number, array $data): void
    {
        $header = ProductInputHeader::factory()->create([
            'bill_number' => $bill_number
        ]);
        foreach ($data as $page) {
            foreach ($page as $item) {

                $product = Product::factory()->create([
                    'name_ar' => $item['n'],
                    'sell_price' => $item['u_cost'] + ($item['u_cost'] * 0.3),
                ]);
                $header->items()->create([
                    'product_id' => $product->id,
                    'quantity' => $item['qt'],
                    'unit_cost_price' => $item['u_cost'],
                    'total_cost_price' => $item['u_cost'] * $item['qt'],
                    'expire_date' => trim($item['ex'] ?? ' '),
                    'payment_type' => PaymentType::cash,

                ]);
            }
        }
    }


    public function bil2476(): void
    {

        $a1 = [
            ['ex' => '       ', 'qt' => 4, 'u_cost' => 3980.00, 'n' => 'بيبي جوي رقم واحد مواليد 66'],
            ['ex' => '       ', 'qt' => 1, 'u_cost' => 4370.00, 'n' => 'بيبي جوي رقم 483'],
            ['ex' => '       ', 'qt' => 3, 'u_cost' => 4220.00, 'n' => 'بيبي جوي رقم 2 66'],
            ['ex' => '       ', 'qt' => 3, 'u_cost' => 4370.00, 'n' => 'بيبي جوي عائلي عبوه 44 رقم 4'],
            ['ex' => '       ', 'qt' => 4, 'u_cost' => 2750.00, 'n' => 'كونفي مواليد رقم 1 44'],
            ['ex' => '       ', 'qt' => 2, 'u_cost' => 4300.00, 'n' => 'كونفي رقم 702'],
            ['ex' => '       ', 'qt' => 3, 'u_cost' => 4300.00, 'n' => 'كونفي رقم 603'],
            ['ex' => '       ', 'qt' => 3, 'u_cost' => 4300.00, 'n' => 'كونفي رقم 4 50'],
            ['ex' => '07/2927', 'qt' => 4, 'u_cost' => 360.00, 'n' => 'مناديل مبلله دادي عبوه 72'],
            ['ex' => '01/2027', 'qt' => 4, 'u_cost' => 500.00, 'n' => 'مناديل مبلله زين عبوه 120 حبه'],
            ['ex' => '01/2029', 'qt' => 10, 'u_cost' => 770.00, 'n' => 'فاين قل عايلي 1300 الاصفر'],
            ['ex' => '11/2025', 'qt' => 4, 'u_cost' => 3250.00, 'n' => 'حليب فرانس ليه رقم 1'],
            ['ex' => '02/2026', 'qt' => 4, 'u_cost' => 3250.00, 'n' => 'حليب فرانس ليه رقم 2'],
            ['ex' => '07/2026', 'qt' => 4, 'u_cost' => 3040.00, 'n' => 'حليب رجلاك رقم 1'],
            ['ex' => '01/2027', 'qt' => 4, 'u_cost' => 3040.00, 'n' => 'حليب رجلاك رقم 2'],
            ['ex' => '07/2026', 'qt' => 4, 'u_cost' => 3250.00, 'n' => 'حليب رجلاك رقم 3'],
            ['ex' => '08/2026', 'qt' => 4, 'u_cost' => 3300.00, 'n' => 'حليب فرانس ليه رقم 3'],
            ['ex' => '05/2026', 'qt' => 10, 'u_cost' => 300.00, 'n' => 'رز مصری غذام'],
            ['ex' => '04/2026', 'qt' => 7, 'u_cost' => 485.00, 'n' => 'بسكويت بسكي اطفال .'],
            ['ex' => '07/2026', 'qt' => 7, 'u_cost' => 650.00, 'n' => 'سيرلاك غذاء مبكت منوع.'],
            ['ex' => '       ', 'qt' => 10, 'u_cost' => 95.00, 'n' => 'اعواد اذان خشب 100'],
            ['ex' => '       ', 'qt' => 10, 'u_cost' => 210.00, 'n' => 'اعواد اذن خشب صيني 200 حبه خليل كبير'],
            ['ex' => '01/2027', 'qt' => 8, 'u_cost' => 640.00, 'n' => 'معجون دابر بالأعشاب مع الفرشاة'],
            ['ex' => '07/2027', 'qt' => 5, 'u_cost' => 325.00, 'n' => 'سجنال معجون وسط الاصلي'],
            ['ex' => '07/2027', 'qt' => 5, 'u_cost' => 190.00, 'n' => 'معجون سجنال صغير اصلي'],
            ['ex' => '05/2027', 'qt' => 3, 'u_cost' => 595.0, 'n' => 'معجون سجنال كبير سعودي 125 مل'],
        ];


        $a2 = [
            ['ex' => '       ', 'qt' => 1, 'u_cost' => 1650.00, 'n' => 'فرش استان سبتادینت'],
            ['ex' => '01/2029', 'qt' => 20, 'u_cost' => 190.00, 'n' => 'فرش اسنان سيلكون الأصلي دكتور'],
            ['ex' => '       ', 'qt' => 1, 'u_cost' => 950.00, 'n' => 'فرش اطفال اورنج ابو غطا'],
            ['ex' => '08/2026', 'qt' => 10, 'u_cost' => 290.00, 'n' => 'صابون جونسون اطفال جديد'],
            ['ex' => '08/2029', 'qt' => 5, 'u_cost' => 650.00, 'n' => 'صابون مينا بابايا'],
            ['ex' => '11/2026', 'qt' => 5, 'u_cost' => 400.00, 'n' => 'صابون ديتول كبير اصلي'],
            ['ex' => '01/2027', 'qt' => 5, 'u_cost' => 220.00, 'n' => 'صابون لوكس صغير'],
            ['ex' => '10/2026', 'qt' => 5, 'u_cost' => 220.00, 'n' => 'صابون لايفبوي سعودي صغير'],
            ['ex' => '01/2028', 'qt' => 5, 'u_cost' => 395.00, 'n' => 'صابون دوف صغير المالي'],
            ['ex' => '01/2029', 'qt' => 5, 'u_cost' => 480.00, 'n' => 'رضاعات الامير كبير'],
            ['ex' => '       ', 'qt' => 5, 'u_cost' => 200.00, 'n' => 'رضاعات مواليد الأمير 60 ملي'],
            ['ex' => '       ', 'qt' => 5, 'u_cost' => 480.00, 'n' => 'رضاعات بتاتو وسط معتم 150 مل'],
            ['ex' => '12/2026', 'qt' => 5, 'u_cost' => 380.00, 'n' => 'زيت الزيتون المروى'],
            ['ex' => '05/2026', 'qt' => 5, 'u_cost' => 400.00, 'n' => 'زيت الزيتون ليدي بلاص 175 مل'],
            ['ex' => '01/2027', 'qt' => 3, 'u_cost' => 880.00, 'n' => '- زيت جونسون اطفال الاصلي 200 مل'],
            ['ex' => '11/2028', 'qt' => 5, 'u_cost' => 500.00, 'n' => 'زيت اطفال بيدا 200 مل'],
            ['ex' => '05/2029', 'qt' => 5, 'u_cost' => 1200.00, 'n' => '- زيت نونو 200 مل'],
            ['ex' => '02/2026', 'qt' => 5, 'u_cost' => 580.00, 'n' => 'بودره كوبر 400 جرام مع شامبو 100 مل دعايه'],
            ['ex' => '10/2027', 'qt' => 5, 'u_cost' => 290.00, 'n' => 'بودره كوبر صغير شامبو دعايه 50 مل'],
            ['ex' => '02/2027', 'qt' => 5, 'u_cost' => 730.00, 'n' => 'بودره كوبر كبير 600 مع شامبو 100 مل دعايه'],
            ['ex' => '09/2028', 'qt' => 5, 'u_cost' => 380.00, 'n' => 'بودره كوبر وسط 200 مع شامبو 50 مل دعايه'],
            ['ex' => '02/2026', 'qt' => 3, 'u_cost' => 545.00, 'n' => 'شحم كوبرا 180 جرام وسط'],
            ['ex' => '       ', 'qt' => 2, 'u_cost' => 6500.00, 'n' => 'حفاضات لاكي بالغين كبير 30 حبة'],
            ['ex' => '       ', 'qt' => 2, 'u_cost' => 5900.00, 'n' => 'حفاضات لاكي بالغين وسط 30 حبة'],
            ['ex' => '02/2026', 'qt' => 5, 'u_cost' => 545.00, 'n' => 'شحم كوبرا 180 جرام وسط'],
            ['ex' => '02/2028', 'qt' => 5, 'u_cost' => 175.00, 'n' => 'شحم كوبر صغير جدا 45 جرام'],
        ];

        $a3 = [
            ['ex' => '05/2026', 'qt' => 3, 'u_cost' => 640.00, 'n' => 'زيت فاتيكا منوع صغير'],
            ['ex' => '09/2026', 'qt' => 3, 'u_cost' => 1020.00, 'n' => 'زيت فاتيكا منوع كبير'],
            ['ex' => '01/2030', 'qt' => 5, 'u_cost' => 280.00, 'n' => 'شامبو اطفال بيبي شوف 100 ملي'],
            ['ex' => '01/2030', 'qt' => 5, 'u_cost' => 385.00, 'n' => 'شامبو اطفال بيبي شوف 200 ملي'],
            ['ex' => '01/2030', 'qt' => 5, 'u_cost' => 1100.00, 'n' => 'شامبو اطفال بيبي شوف 800 ملى -'],
            ['ex' => '11/2026', 'qt' => 2, 'u_cost' => 1700.00, 'n' => 'نيقياء ألماني كبير 250 جرام'],
            ['ex' => '09/2026', 'qt' => 2, 'u_cost' => 1200.00, 'n' => 'نيفياء ألماني وسط'],
            ['ex' => '08/2027', 'qt' => 2, 'u_cost' => 1450.00, 'n' => 'كريم جليسوليد كبير'],
            ['ex' => '08/2027', 'qt' => 2, 'u_cost' => 945.00, 'n' => 'گریم جليسوليد وسط'],
            ['ex' => '07/2027', 'qt' => 2, 'u_cost' => 695.00, 'n' => 'كريم جليسوليد صغير مع الاضافة'],
            ['ex' => '       ', 'qt' => 1, 'u_cost' => 1200.00, 'n' => 'لصقة عمليات 55 عبوة 50 سران'],
            ['ex' => '01/2026', 'qt' => 1, 'u_cost' => 2000.00, 'n' => 'لصق عمليات 2010 عبوه 25'],
            ['ex' => '01/2029', 'qt' => 11, 'u_cost' => 3950.00, 'n' => 'لصق عمليات تايجر 2510'],
            ['ex' => '06/2026', 'qt' => 5, 'u_cost' => 1000.00, 'n' => 'غذاء ريرى بدون مرتجع'],
        ];


        $this->createBill(2476, [$a1, $a2, $a3]);
    }

    public function bil670382(): void
    {
        $qerbah = $this->qerbah;
        $backet = $this->backet;
        $vialah = $this->vialah;
        $ambola = $this->ambola;

        $a1 = [
            ['ex' => '2027/02/01', 'qt' => 4, 'u_cost' => 1100, 'n' => 'اوجمين شراب ۲۲۸ ملجم الدوانية الحديثة'],
            ['ex' => '2028/02/01', 'qt' => 5, 'u_cost' => 730, 'n' => 'موكسالين ٢٥٠ ملجم شراب الدوائية الحديثة'],
            ['ex' => '2026/10/01', 'qt' => 4, 'u_cost' => 975, 'n' => 'او جمين ١٥٦ ملجم شراب الدوائية الحديثة'],
            ['ex' => '2026/09/01', 'qt' => 4, 'u_cost' => 1400, 'n' => 'اوجمين ۳۱۲ ملجم شراب الدوائية الحديثة'],
            ['ex' => '2027/02/01', 'qt' => 4, 'u_cost' => 1500, 'n' => 'اوجمين ٤٥٧ ملجم شراب الدوائية الحديثة'],
            ['ex' => '2027/05/01', 'qt' => 4, 'u_cost' => 495, 'n' => 'قومين ٧٥ اقراص الدوائية الحديثة'], //shareed
            ['ex' => '2027/02/01', 'qt' => 3, 'u_cost' => 3850, 'n' => ' ميبو مرهم كبير ٣٠ جرام جلفار'], //habah
            ['ex' => '2027/08/01', 'qt' => 5, 'u_cost' => 700, 'n' => 'جوافا شراب ۱۲۰ مل الرشيد سعال'],
            ['ex' => '2028/10/01', 'qt' => 7, 'u_cost' => 1845, 'n' => 'نيتروماك ريتارد ٢.٥ ملجم ٦٠ك الفتح'],
            ['ex' => '2027/01/01', 'qt' => 5, 'u_cost' => 550, 'n' => 'فاركونسيل ١٢٥ ملجم شراب ٨٠ مل فاركو موكسالين'],
            ['ex' => '2027/10/01', 'qt' => 5, 'u_cost' => 640, 'n' => 'فاركونسيل ٢٥٠ منجم شراب ٨٠ مل قار کو موكسالين'],
            ['ex' => '2026/10/01', 'qt' => 3, 'u_cost' => 650, 'n' => 'فيتامين سي ۱۰۰۰ مل ظروف فاركو فوار سي'], //habah
            ['ex' => '2026/11/01', 'qt' => 5, 'u_cost' => 520, 'n' => 'يوريكول فرار ١٢ كيس فاركو'], //kees
            ['ex' => '2026/04/01', 'qt' => 3, 'u_cost' => 1590, 'n' => 'اسبرين مغلف ٧٥ ملجم اقراص المحضار اخوان'], //shareed
            ['ex' => '2026/10/01', 'qt' => 3, 'u_cost' => 1500, 'n' => 'سيبرولون ٢٥ ملح أقراص الكتون أمير الدين'], //shreed
            ['ex' => '2026/05/01', 'qt' => 5, 'u_cost' => 750, 'n' => 'كلين انما حقن شرجية كبار العزاني'], //habah
            ['ex' => '2027/06/01', 'qt' => 5, 'u_cost' => 970, 'n' => 'بندول شراب للرضع بنكة الفراولة المنصوب'],
            ['ex' => '2027/07/01', 'qt' => 5, 'u_cost' => 1750, 'n' => 'بندول شراب أزرق للأطفال اليكسير ١٠٠ مل المنصوب'],
            ['ex' => '2027/08/01', 'qt' => 2, 'u_cost' => 2100, 'n' => 'سولبادين فوار المنصوب'],
            ['ex' => '2026/05/01', 'qt' => 3, 'u_cost' => 1150, 'n' => 'بتدول اكستر - المنصوب وكالة'],
            ['ex' => '2027/01/01', 'qt' => 2, 'u_cost' => 2850, 'n' => 'نورمادبين 5 ملجم اقراص بلقيس'], //shareed
            ['ex' => '2026/08/01', 'qt' => 1, 'u_cost' => 3490, 'n' => 'نورمادبين ١٠ ملم اقراص بلقيس'], //shareed
            ['ex' => '2026/09/01', 'qt' => 3, 'u_cost' => 1.815, 'n' => 'اتروليب ١٠ ملجم اقراص ٣٠ ٤ سيبلا'], //shareed
            ['ex' => '2027/08/01', 'qt' => 3, 'u_cost' => 2.725, 'n' => 'اتروليب ۲۰ ملجم اقراص ٣٠ سيبلا'], //shareed
            ['ex' => '2027/07/01', 'qt' => 3, 'u_cost' => 1.550, 'n' => 'اتروليب ٤٠ ملجم اقراص ۱۰ ق سيبلا'], //shareed
            ['ex' => '2027/07/01', 'qt' => 3, 'u_cost' => 1645, 'n' => 'ديتور ١٠ ملجم اقراص سيبلا'], //shareed
            ['ex' => '2027/07/01', 'qt' => 3, 'u_cost' => 1895, 'n' => 'ديتور ۲۰ ملجم اقراص سيبلا'], //shareed
            ['ex' => '2026/10/01', 'qt' => 5, 'u_cost' => 1245, 'n' => 'بانتوسيك ٤٠ ملجم اقراص سيبلا'], //shareed
            ['ex' => '2027/07/01', 'qt' => 3, 'u_cost' => 3475, 'n' => 'دوفلاك شراب الراقة بدون مرتجع'],
            ['ex' => '2027/06/01', 'qt' => 1, 'u_cost' => 5460, 'n' => 'نيادي بنك ريتارد ۲۰ ملجم ۱۰۰ الغزالي'], //sh
            ['ex' => '2026/12/01', 'qt' => 5, 'u_cost' => 470, 'n' => 'ايبوفلام شراب ۱۰۰ مل كبير شفاكو'],
            ['ex' => '2026/12/01', 'qt' => 5, 'u_cost' => 600, 'n' => 'اسبيكوت ٧٥ ملجم اقراص شفاكو أسبرين مختلف'], //sh
            ['ex' => '2028/02/01', 'qt' => 6, 'u_cost' => 2250, 'n' => 'كلوفال ٧٥ ملح اقراص ۲۸ قرص شفاكو بلافيكس كلوبي'], //sh
            ['ex' => '2027/01/01', 'qt' => 5, 'u_cost' => 1540, 'n' => 'اكسوبان ٤٠ ملجم كبسول ٣٠ ك بانتوبرازول شفاكو'], //sh
            ['ex' => '2027/05/01', 'qt' => 10, 'u_cost' => 600, 'n' => 'فولتين دي تي شفاكو ايمفيناك'], //haba
            ['ex' => '2028/02/01', 'qt' => 7, 'u_cost' => 260, 'n' => 'امول اقراص صغير شفاكر'], //habah
            ['ex' => '2028/03/01', 'qt' => 7, 'u_cost' => 320, 'n' => 'امول اكسترا شريطين اقراص شفاكو'], //habah
        ];

        $a2 = [

            ['ex' => '2027/01/01', 'qt' => 3.00, 'u_cost' => 500, 'n' => 'ميوفيت سي أكياس ۱۰۰۰ ملجم شفاكو فيتامين سي'],
            ['ex' => '2026/08/01', 'qt' => 2.00, 'u_cost' => 1400, 'n' => 'او ميتوب ۲۰ ملجم اقراص شفاكو'],
            ['ex' => '2027/07/01', 'qt' => 4.00, 'u_cost' => 600, 'n' => 'فيتامين سي صافي فوار القادري فيت سي'],
            ['ex' => '2027/07/01', 'qt' => 4.00, 'u_cost' => 640, 'n' => 'كالسيوم فيتامين سي فوار القادري كالسيفيت'],
            ['ex' => '2027/09/01', 'qt' => 3.00, 'u_cost' => 1200, 'n' => 'سولباقيز فوار رويال سولبادين'],
            ['ex' => '2026/08/01', 'qt' => 3.00, 'u_cost' => 480, 'n' => 'کولداکت شراب بیوفارم فلوكيت فلودرين'],
            ['ex' => '2027/07/01', 'qt' => 3.00, 'u_cost' => 510, 'n' => 'كولداكت كبسول بيوفارما فلوتاب'],
            ['ex' => '2027/10/01', 'qt' => 4.00, 'u_cost' => 940, 'n' => 'امفيناك دي تي ٥٠ ملجم ك النهدي ديكلوفين'],
            ['ex' => '2027/08/01', 'qt' => 10.00, 'u_cost' => 280, 'n' => 'زبین شراب رنتل الجبر فارما'],
            ['ex' => '2029/08/01', 'qt' => 10.00, 'u_cost' => 190, 'n' => 'زبين ۲۰۰ ملجم زنتل / اقراص الجبر فارما'],
            ['ex' => '2026/06/01', 'qt' => 10.00, 'u_cost' => 400, 'n' => 'ماء سيد شراب الوراقي ماء غريب'],
            ['ex' => '2026/08/01', 'qt' => 5.00, 'u_cost' => 980, 'n' => 'ابیدون ١٢٥ ملجم شراب أمون القاهرة'],
            ['ex' => '2026/05/01', 'qt' => 10.00, 'u_cost' => 430, 'n' => 'بيروفين قطر سباء فارما'],
            ['ex' => '2027/11/01', 'qt' => 5.00, 'u_cost' => 510, 'n' => 'هستات شراب ١٠٠ مل سباء فارما'],
            ['ex' => '2027/08/01', 'qt' => 5.00, 'u_cost' => 479, 'n' => 'موتلين ٦٠ ملجم شراب سباء فارما'],
            ['ex' => '2027/02/01', 'qt' => 10.00, 'u_cost' => 395, 'n' => 'هكساديل مضمضه ١٠٠ مل سباء فارما'],
            ['ex' => '2027/01/01', 'qt' => 1.00, 'u_cost' => 4150, 'n' => 'فالسيترى ٢٦/٢٤ ملجم ٣٠ قرص ساكو بلاص سفرماد'],
            ['ex' => '2027/12/01', 'qt' => 5.00, 'u_cost' => 270, 'n' => 'سباء فارما'],
            ['ex' => '2027/05/01', 'qt' => 5.00, 'u_cost' => 450, 'n' => 'هستات اقرص ۲۰ ق سباء فارما'],
            ['ex' => '2026/07/01', 'qt' => 5.00, 'u_cost' => 210, 'n' => 'موتلين ٣٠ مل قطر سباء فارما'],
            ['ex' => '2026/08/01', 'qt' => 2.00, 'u_cost' => 2890, 'n' => 'يوتابين قيال ١.٢ فيال لاااااااب بعوم'],
            ['ex' => '2026/06/01', 'qt' => 2.00, 'u_cost' => 2645, 'n' => 'جارديان ۱۰ ملح القرص ايمبافت ابن القادري'], // shareed
            ['ex' => '2028/01/01', 'qt' => 2.00, 'u_cost' => 2080, 'n' => 'جارديان ٢٥ ملجم اقرص ايمپافنت ابن القادري -'], // shareed
            ['ex' => '2027/11/01', 'qt' => 2.00, 'u_cost' => 3100, 'n' => 'ايمبا ١٠ ملجم اقراص العالميه ايمباقنت'], // shareed
            ['ex' => '2028/04/01', 'qt' => 10.00, 'u_cost' => 550, 'n' => 'ايمبا ٢٥ ملجم اقراص العالميه ايمبافنت'], // shareed
            ['ex' => '2026/11/01', 'qt' => 2.00, 'u_cost' => 2800, 'n' => 'أمبروفين فراولة ۱۰۰مل اليمنية المصرية 7'], // zogagah
            ['ex' => '2026/11/01', 'qt' => 2.00, 'u_cost' => 1900, 'n' => 'لينوبريل ١٠ ملجم اقراص الدولية الاردنية'], //shareed
            ['ex' => '2027/07/01', 'qt' => 2.00, 'u_cost' => 280, 'n' => 'لينوبريل 5ملجم اقراص الدولية الأردنية'], //shareed
            ['ex' => '2026/09/01', 'qt' => 2.00, 'u_cost' => 1709, 'n' => 'اسبين 100 ملجم اقراص سيبلا'], //shareed
            ['ex' => '2028/07/01', 'qt' => 3.00, 'u_cost' => 2.200, 'n' => 'لوماك ۲۰ منجم كبسول أشرطة سيبلا'], //habah
            ['ex' => '2026/08/01', 'qt' => 3.00, 'u_cost' => 870, 'n' => 'مبيو مرهم ... صغير أبو زيد'], //marham
            ['ex' => '2026/11/01', 'qt' => 3.00, 'u_cost' => 2480, 'n' => 'فاديرين 81 ملجم اقراص هيلثي فارما جوسبرين -'], //shareed
            ['ex' => '2027/07/01', 'qt' => 5.00, 'u_cost' => 435, 'n' => 'ابيكسان هيل 5 ملجم اقراص ابيكسا هيلان'], ////shareed
            ['ex' => '2026/01/01', 'qt' => 5.00, 'u_cost' => 520, 'n' => 'سكو فاست اقراص العابد امفيناك بدون مرتجع'], //habah
            ['ex' => '2027/07/01', 'qt' => 3.00, 'u_cost' => 6.700, 'n' => 'بوفين شراب ۱۰۰مل الخياط امبروفين شراب'], // zpg
            ['ex' => '2027/06/01', 'qt' => 3, 'u_cost' => 52, 'n' => 'بلافيكس ٧٥ ملجم اقراص الصباري '], //shareed
            ['ex' => '2027/06/01', 'qt' => 30.00, 'u_cost' => 52, 'n' => 'بانتوبرازول ٤٠ فيال اميال فارما بالتوفيكس'], //shareed


        ];
        $a3 = [
            ['ex' => '2028/03/01', 'qt' => 5, 'u_cost' => 560, 'n' => 'موكسالين ١٢٥ ملجم شراب الدوائية الحديثة'],
            ['ex' => '2027/05/01', 'qt' => 5, 'u_cost' => 600, 'n' => 'توسكان شراب الجبل'],
            ['ex' => '2026/08/01', 'qt' => 4, 'u_cost' => 940, 'n' => 'بيستول ۲٫٥ ملغ اقراص الجبل'],
            ['ex' => '2027/08/01', 'qt' => 4, 'u_cost' => 1150, 'n' => 'بیستول ٥ ملغ اقراص عادي الجبل'],
            ['ex' => '2027/09/01', 'qt' => 2, 'u_cost' => 4000, 'n' => 'سوفيكان ٢٠ ملغ اقراص الجبل'],
            ['ex' => '2027/09/01', 'qt' => 2, 'u_cost' => 2795, 'n' => 'سوفيكان ١٠ ملح أقراص الجبل الحكمه'],
            ['ex' => '2027/06/01', 'qt' => 5, 'u_cost' => 425, 'n' => 'موتيل ١٠٠مل موتلين شراب العالمية'],
            ['ex' => '2027/10/01', 'qt' => 4, 'u_cost' => 1300, 'n' => 'نيولاكس ۱۰۰ مل شراب العالمية لاكسولاك'],
            ['ex' => '2027/07/01', 'qt' => 1, 'u_cost' => 2550, 'n' => 'هايبين ٥٠٠مل اقراص الجبل أموكسيل ۱۰ ش'],
        ];
        $this->createBill(670382, [$a1, $a2, $a3]);
    }

    public function bil670349(): void
    {
        $qerbah = $this->qerbah;
        $backet = $this->backet;
        $vialah = $this->vialah;
        $ambola = $this->ambola;
        $a1 = [
            ['u_type' => $qerbah, 'u_cost' => 1100, 'qt' => 5.00, 'n' => 'بیمناست ۱۰۰۰ ملجم فيال العربية فوربار'],
            ['u_type' => $qerbah, 'u_cost' => 510, 'qt' => 20.00, 'n' => 'زوراكسون ۱۰۰۰ ملجم وريدي الفتح فورسيف'],
            ['u_type' => $qerbah, 'u_cost' => 510, 'qt' => 10.00, 'n' => 'سيفوران 1 جرام فيال فارکو اور تاکسیم'],
            ['u_type' => $qerbah, 'u_cost' => 830, 'qt' => 5.00, 'n' => 'باراسيتامول قرب برفلجان فاركو'],
            ['u_type' => $qerbah, 'u_cost' => 680, 'qt' => 10.00, 'n' => 'اور تکسیم اجرام فيال الجبل'],
            ['u_type' => $qerbah, 'u_cost' => 1380, 'qt' => 5.00, 'n' => 'سيفتاد ۱۰۰۰ قيال فوربار الجبل'],
            ['u_type' => $qerbah, 'u_cost' => 1765, 'qt' => 5.00, 'n' => 'قوربار اجرام فيال سيبلا'],
            ['u_type' => $qerbah, 'u_cost' => 2070, 'qt' => 3.00, 'n' => 'انسولين اتش بيو ار فيال أصفر) سيديكو الحارث'],
            ['u_type' => $qerbah, 'u_cost' => 1950, 'qt' => 4.00, 'n' => 'هيبارين صوديوم ٥٠٠٠ وحدة عبوة 3 أمبولات جديد الحارث'],
            ['u_type' => $qerbah, 'u_cost' => 350, 'qt' => 5.00, 'n' => 'سيبروفلوكساسين محلول العافية سيبلوكس'],
            ['u_type' => $qerbah, 'u_cost' => 630, 'qt' => 5.00, 'n' => 'ديكساميتازون امبول فلهوم'],
            ['u_type' => $qerbah, 'u_cost' => 590, 'qt' => 5.00, 'n' => 'زجاج برفلجان قرب زجاج فلهوم'],
            ['u_type' => $qerbah, 'u_cost' => 190, 'qt' => 20.00, 'n' => 'ديكستروز ٤٠% امبول رويال فارما بالحبه الواحده'],
            ['u_type' => $qerbah, 'u_cost' => 680, 'qt' => 5.00, 'n' => 'براسيتامول مغنيات زجاج رويال بر فلجان رویامول'],
            ['u_type' => $qerbah, 'u_cost' => 440, 'qt' => 5.00, 'n' => 'اقيل امبول رويال فارما'],
            ['u_type' => $qerbah, 'u_cost' => 540, 'qt' => 5.00, 'n' => 'بليمازول امبول رويال فارما ريمو بلازا'],
            ['u_type' => $qerbah, 'u_cost' => 530, 'qt' => 3.00, 'n' => 'بي كومبلكس أمبول رويال فارما'],
            ['u_type' => $qerbah, 'u_cost' => 380, 'qt' => 3.00, 'n' => 'فيتامين سي أمبول ٥٠٠ رويال فارما'],
            ['u_type' => $qerbah, 'u_cost' => 520, 'qt' => 5.00, 'n' => 'جنتاميسين أمبول ۸۰ ملجم رويال فارما'],
            ['u_type' => $qerbah, 'u_cost' => 660, 'qt' => 10.00, 'n' => 'متريندازول قرب جال فارما فلاجيل بدون موصل'],
            ['u_type' => $qerbah, 'u_cost' => 2290, 'qt' => 5.00, 'n' => 'انترابيم قيال مياس 1 جرام سيفبيم قوربار'],
            ['u_type' => $qerbah, 'u_cost' => 1530, 'qt' => 5.00, 'n' => 'باراكونيكا اجرام فيال محلات مياس برفلجان'],
            ['u_type' => $qerbah, 'u_cost' => 8550, 'qt' => 1.00, 'n' => 'كمبونينت فيال ۲۰ ف أرض الجنتين كومبيفيت'],
            ['u_type' => $qerbah, 'u_cost' => 1180, 'qt' => 4.00, 'n' => 'دوبروس ۲۰۰ مل امبول دوبامين بعوم'],
            ['u_type' => $qerbah, 'u_cost' => 6430, 'qt' => 3.00, 'n' => 'وکیل مختوم تینام ٥٠٠ ملجم بان مبنيم مهدي الشاعر'],
            ['u_type' => $qerbah, 'u_cost' => 4030, 'qt' => 5.00, 'n' => 'فانكومايسين اجرام فيال الشاعر فانكولون ۱۰۰۰'],
            ['u_type' => $qerbah, 'u_cost' => 1280, 'qt' => 5.00, 'n' => 'ستو بالجيك برفلجان بارستامول مغنية الشاعر'],
            ['u_type' => $qerbah, 'u_cost' => 450, 'qt' => 5.00, 'n' => 'سيبروفلوكساسين قرب الجيش سيبلوكس سيبروكيد'],
            ['u_type' => $qerbah, 'u_cost' => 499, 'qt' => 20.00, 'n' => 'سيبلاسيف اجرام فيال سيبلا'],
            ['u_type' => $qerbah, 'u_cost' => 519, 'qt' => 10.00, 'n' => 'سيبلاسيف ٥٠٠ ملجم فيال سيبلا'],
            ['u_type' => $qerbah, 'u_cost' => 5150, 'qt' => 3.00, 'n' => 'سیلاكيب ٥٠٠ جرام فيال تينام رسام الشاعر'],
            ['u_type' => $qerbah, 'u_cost' => 4400, 'qt' => 4.00, 'n' => 'موبيم ا مجم فيال رسام الشاعر میرونیم مورنیم بدون مرتجع'],
            ['u_type' => $qerbah, 'u_cost' => 3300, 'qt' => 2.00, 'n' => 'دايميد ۲۰ منجم امبول الربيعي ديتور ١٠ امبول'],
            ['u_type' => $qerbah, 'u_cost' => 360, 'qt' => 30.00, 'n' => 'سكر مغنيات الجبل'],
            ['u_type' => $qerbah, 'u_cost' => 370, 'qt' => 30.00, 'n' => 'رنجر مغذيات الجبل'],

        ];
        $a2 = [
            ['u_cost' => 310, 'u_type' => $qerbah, 'qt' => 10, 'n' => ' فلاجيل قرب مع الموصلات اميال فارما بدون مرتجع'],
            ['u_cost' => 580, 'u_type' => $backet, 'qt' => 10, 'n' => ' روها ليفوفلوكساسين قرب ۱۰۰ مل روها فارما معى الموصل ليلوباكت'],
            ['u_cost' => 340, 'u_type' => $backet, 'qt' => 5, 'n' => ' روها سيبروفلوكساسين قرب ۱۰۰ مل روها فارما معى الموصل سيبلوكس'],
            ['u_cost' => 1690, 'u_type' => $backet, 'qt' => 3, 'n' => ' اوندر يسترون امبول ۸ ملجم صادق البرحي ايمست'],
            ['u_cost' => 4940, 'u_type' => $vialah, 'qt' => 4, 'n' => ' سالاتاز ٤٥ فيال الأمل تاركت'],
            ['u_cost' => 1550, 'u_type' => $ambola, 'qt' => 4, 'n' => ' لازكس امبول الصباري'],
            ['u_cost' => 320, 'u_type' => $vialah, 'qt' => 10, 'n' => ' هيتاسون ۱۰۰ ملجم فيال فارما بيدا هيدروكرتزون'],
            ['u_cost' => 870, 'u_type' => $backet, 'qt' => 3, 'n' => ' بروسيوم ١٠ امبول امبولات فارما بيدا مغناسيوم'],
            ['u_cost' => 290, 'u_type' => $vialah, 'qt' => 20, 'n' => ' سيفتر یاکسون أكوي اجم فيال تعافي فارما سي ون سيبلاسيف'],
            ['u_cost' => 3300, 'u_type' => $qerbah, 'qt' => 4, 'n' => ' نازکت کوزمابيتاز ٤,٥ ملجم قرب الجيش تازكت'],
            ['u_cost' => 290, 'u_type' => $backet, 'qt' => 10, 'n' => ' كورما تكسي اجرام فيال اور تكسيم سيفوتاكسيم الجيش و'],
            ['u_cost' => 6100, 'u_type' => $backet, 'qt' => 1, 'n' => ' ديتور امبول عبوة ۲۰ امبوله ابوزيد سيبلا ٢٠ أم'],
            ['u_cost' => 5300, 'u_type' => $vialah, 'qt' => 3, 'n' => ' ميراكوي اجم فيال تعافي فارما ميرونيم'],
            ['u_cost' => 2550, 'u_type' => $backet, 'qt' => 5, 'n' => ' افسيناف اجم فيال فانكومايسين تعافي فارما'],
            ['u_cost' => 3300, 'u_type' => $backet, 'qt' => 3, 'n' => ' اینوکس بارين ٤٠٠٠ و دتعافي فارما ٢ أمبول'],
            ['u_cost' => 4300, 'u_type' => $backet, 'qt' => 3, 'n' => ' اینو كسبارين ٦٠٠٠ و دتعافي فارما ٢ امبول'],
            ['u_cost' => 2800, 'u_type' => $vialah, 'qt' => 10, 'n' => ' کابرین ۲۵۰۰۰ و.د فيال فارما بيوتك هيبارين'],
            ['u_cost' => 3700, 'u_type' => $qerbah, 'qt' => 120, 'n' => ' ملح مغنيات القطريفي'],
            ['u_cost' => 3700, 'u_type' => $qerbah, 'qt' => 48, 'n' => ' مخلوط مغذيات القطريفي'],
            ['u_cost' => 1960, 'u_type' => $vialah, 'qt' => 5, 'n' => ' فانكوبال ۱۰۰۰ ملجم فيال أميال فانكوميسين'],
            ['u_cost' => 1300, 'u_type' => $qerbah, 'qt' => 10, 'n' => ' سوكسيبال مغذيات اميال فارما موكساسيب'],
            ['u_cost' => 725, 'u_type' => $backet, 'qt' => 10, 'n' => ' فير سدرين ٢ ملي أمبول لازكس بريميم ديرين'],
            ['u_cost' => 1550, 'u_type' => $backet, 'qt' => 3, 'n' => ' درسترون ۲ ملي أمبول ايمست بریمیم دیرین'],
            ['u_cost' => 3050, 'u_type' => $backet, 'qt' => 3, 'n' => ' ليفيتام ٥٠٠ ملجم فيال كيبرا بیوسنسورس بيواكتف'],
            ['u_cost' => 5000, 'u_type' => $vialah, 'qt' => 2, 'n' => ' فاتكولون ۱۰۰۰ ملجم فيال جلفار'],
            ['u_cost' => 280, 'u_type' => $backet, 'qt' => 10, 'n' => ' روها میترندازول ۱۰۰ ما قرب روها فارما معى الموصل فلاجيل']
        ];
        $this->createBill(670349, [$a1, $a2]);
    }
}
